akafugu/Xmegaduino/hardware/arduino/xmega/boards.txt

menu.programmer=Upload programmer
menu.cpu=Processor

##############################################################

api.name=Apitronics Bee

api.build.mcu=atxmega128a3
api.build.f_cpu=32000000L
api.build.core=xmega
api.build.variant=api

api.upload.tool=avrdude
api.upload.protocol=avr109
api.upload.speed=115200
api.upload.maximum_size=131072

#############################################################

sfe.name=SparkFun Xmega100
sfe.verbose=true

sfe.build.mcu=atxmega128a1
sfe.build.f_cpu=32000000L
sfe.build.core=xmega
sfe.build.variant=sfe

sfe.upload.tool=avrdude
sfe.upload.maximum_size=131072

# FUSE BITS
# fuse0: JTAGUSERID
# fuse1: WDWP=0xF WDP=0xF
# fuse2: Boot Loader Reset
# fuse4: JTAGEN
# fuse5: BODLVL=2.1V
sfe.bootloader.tool=avrdude
sfe.bootloader.fuse0=0xFF
sfe.bootloader.fuse1=0xFF
#sfe.bootloader.fuse2=0xBF
sfe.bootloader.fuse2=0xFF
sfe.bootloader.fuse4=0xFE
sfe.bootloader.fuse5=0xFD
sfe.bootloader.unlock_bits=0x3F
sfe.bootloader.lock_bits=0x3F
sfe.bootloader.file=sfe_xmega100/ATmegaBOOT_sfe.bin

## SparkFun w/ JTAG
## -------------------------
sfe.menu.programmer.jtag=JTAG
sfe.menu.programmer.jtag.upload.using=dragonjtag

## SparkFun w/ PDI
## -------------------------
sfe.menu.programmer.pdi=PDI
sfe.menu.programmer.pdi.upload.using=avrisppdi

#############################################################

xplain.name=XPlain

xplain.build.mcu=atxmega128a1
xplain.build.f_cpu=32000000L
xplain.build.core=xmega
xplain.build.variant=xplain

xplain.upload.tool=avrdude
xplain.upload.maximum_size=131072

# FUSE BITS
# fuse0: JTAGUSERID
# fuse1: WDWP=0xF WDP=0xF
# fuse2: Boot Loader Reset
# fuse4: JTAGEN
# fuse5: BODLVL=2.1V
xplain.bootloader.tool=avrdude
xplain.bootloader.fuse0=0xFF
xplain.bootloader.fuse1=0xFF
xplain.bootloader.fuse2=0xBF
xplain.bootloader.fuse4=0xFE
xplain.bootloader.fuse5=0xFD
xplain.bootloader.unlock_bits=0x3F
xplain.bootloader.lock_bits=0x3F
xplain.bootloader.file=xplain/ATmegaBOOT_xplain.bin

## XPlain w/ JTAG
## -------------------------
xplain.menu.programmer.jtag=JTAG
xplain.menu.programmer.jtag.upload.using=dragonjtag

## XPlain w/ Lufa
## -------------------------
xplain.menu.programmer.lufa=Lufa
xplain.menu.programmer.lufa.upload.using=avrispmkii
xplain.menu.programmer.lufa.upload.protocol=arduino
xplain.menu.programmer.lufa.upload.speed=9600

## XPlain w/ Usb
## -------------------------
xplain.menu.programmer.usb=Usb
xplain.menu.programmer.usb.upload.protocol=arduino
xplain.menu.programmer.usb.upload.speed=9600

## XPlain w/ Serial
## -------------------------
xplain.menu.programmer.serial=Serial
xplain.menu.programmer.serial.upload.protocol=arduino
xplain.menu.programmer.serial.upload.speed=57600

## XPlain w/ Pdi
## -------------------------
xplain.menu.programmer.pdi=PDI
xplain.menu.programmer.pdi.using=avrisppdi

##############################################################

akafuino.name=Akafuino X

akafuino.build.mcu=atxmega32a4
akafuino.build.f_cpu=32000000L
akafuino.build.core=xmega
akafuino.build.variant=akafuino

akafuino.upload.tool=avrdude
akafuino.upload.protocol=avr109
akafuino.upload.maximum_size=32768
akafuino.upload.speed=115200
akafuino.upload.use_1200bps_touch=true

akafuino.bootloader.tool=avrdude
akafuino.bootloader.file=akafuino/akafuino-boot.hex
#akafuino.bootloader.unlock_bits=0x3F
#akafuino.bootloader.lock_bits=0x3F

# FUSE BITS
# fuse0: JTAGUSERID
# fuse1: WDWP=0xF WDP=0xF
# fuse2: Boot Loader Reset
# fuse4: JTAGEN
# fuse5: BODLVL=2.1V
#akafuino.bootloader.fuse0=0xFF
#akafuino.bootloader.fuse1=0xFF
akafuino.bootloader.fuse2=0xBF
#akafuino.bootloader.fuse4=0xFE
akafuino.bootloader.fuse5=0xFD

##############################################################

eka.name=XMEGA128A1 EK-A

eka.build.mcu=atxmega128a1
eka.build.f_cpu=32000000L
eka.build.core=xmega
eka.build.variant=eka

eka.upload.tool=pyc45b
eka.upload.maximum_size=131072
eka.upload.wait_for_upload_port=true
eka.upload.protocol=chip45boot2

eka.bootloader.tool=avrdude
eka.bootloader.maximum_size=131072
eka.bootloader.protocol=PDI
eka.bootloader.file=eka/chip45boot2_atxmega128a1_uartC0_v2.9Q.hex

## XPlain w/ Serial
## -------------------------
eka.menu.programmer.serial=Serial
eka.menu.programmer.serial.upload.speed=115200